In [19]:
#groupby()메서드 사용 
from pandas import Series, DataFrame
import numpy as np 

df = DataFrame({'key1':['a','a','b','b','a'], 
                'key2':['one','two','one','two','one'], 
                'data1':np.random.randn(5), 
                'data2':np.random.randn(5)})
df

  key1 key2     data1     data2
0    a  one  1.163352 -0.461300
1    a  two -1.989881 -1.173820
2    b  one -0.323473  0.601555
3    b  two  0.020775  0.916654
4    a  one -0.630780  1.783137

In [22]:
grouped = df.groupby("key2")["data2"]
grouped

In [23]:
print( grouped.mean() )
print( grouped.sum() )
print( grouped.count() )

key2
one    0.641131
two   -0.128583
Name: data2, dtype: float64
key2
one    1.923392
two   -0.257166
Name: data2, dtype: float64
key2
one    3
two    2
Name: data2, dtype: int64

In [25]:
#복합키컬럼을 사용하는 경우:연속으로 함수, 메서드 호출(메서드체인) 
means = df.groupby( ["key2","key1"] )["data1"].count()
means

key2  key1
one   a       2
      b       1
two   a       1
      b       1
Name: data1, dtype: int64

In [26]:
#학급 성적 
dfClass = DataFrame({"학급":[1,1,2,2,1], 
                     "이름":["홍길동","전우치","이순신","박문수","김길동"],
                     "국어":[100,90,95,100,80], 
                     "영어":[80,90,95,92,89], 
                     "수학":[90,80,92,100,80]
                     })

dfClass

   학급   이름   국어  영어   수학
0   1  홍길동  100  80   90
1   1  전우치   90  90   80
2   2  이순신   95  95   92
3   2  박문수  100  92  100
4   1  김길동   80  89   80

In [28]:
#합계
sum(dfClass["수학"])

442

In [29]:
#평균
sum(dfClass["국어"])/5

93.0

In [32]:
#오름차순
dfClass.sort_values("수학", ascending=False)

   학급   이름   국어  영어   수학
3   2  박문수  100  92  100
2   2  이순신   95  95   92
0   1  홍길동  100  80   90
1   1  전우치   90  90   80
4   1  김길동   80  89   80

In [9]:
#내림차순
dfClass.sort_values("국어", ascending=False)

   학급   이름   국어  영어   수학
0   1  홍길동  100  80   90
3   2  박문수  100  92  100
2   2  이순신   95  95   92
1   1  전우치   90  90   80
4   1  김길동   80  89   80

In [33]:
#새로운 컬럼 추가하기
dfClass["전체"] = dfClass["국어"] + dfClass["수학"] + dfClass["영어"]

In [35]:
#평균을 추가하기 
dfClass["평균"] = ((dfClass["국어"] + dfClass["수학"] + dfClass["영어"])/3).round(2)

In [36]:
dfClass

   학급   이름   국어  영어   수학   전체     평균
0   1  홍길동  100  80   90  270  90.00
1   1  전우치   90  90   80  260  86.67
2   2  이순신   95  95   92  282  94.00
3   2  박문수  100  92  100  292  97.33
4   1  김길동   80  89   80  249  83.00

In [ ]:
#내림차순 정렬하기(역순)
dfClass.sort_values("평균", ascending=False)

   학급   이름   국어  영어   수학   전체         평균
3   2  박문수  100  92  100  292  97.333333
2   2  이순신   95  95   92  282  94.000000
0   1  홍길동  100  80   90  270  90.000000
1   1  전우치   90  90   80  260  86.666667
4   1  김길동   80  89   80  249  83.000000

In [39]:
#학급별로 그룹핑하기 
dfClass.groupby("학급")["영어"].count()

학급
1    3
2    2
Name: 영어, dtype: int64

In [42]:
dfClass.agg(수학평균=("국어","sum"))

       국어
수학평균  465

In [43]:
dfClass.groupby("학급").agg(수학평균=("수학","mean")).round(2)

     수학평균
학급
1   83.33
2   96.00

In [44]:
dfClass.groupby("학급").agg(국어평균=("국어","mean"), 
            수학평균=("수학","mean"),
            영어평균=("영어","mean"), 
            갯수=("학급","count")).round(2)

    국어평균   수학평균   영어평균  갯수
학급
1   90.0  83.33  86.33   3
2   97.5  96.00  93.50   2